       copy "tt-constants.cpy".
       copy "tt-inputs.cpy".
       copy "tt-answers.cpy".
       copy "tt-entities.cpy".
       copy "tt-metadata.cpy".
       copy "tt-rows.cpy".
       copy "tt-events.cpy".
       copy "tt-extensions.cpy".
